contiki-os/contiki/cc26xxware/driverlib/timer.h
#ifdef DRIVERLIB_DEBUG
//*****************************************************************************
//
//! \internal
//!
//! \brief Checks a timer base address.
//!
//! This function determines if a timer module base address is valid.
//!
//! \param ui32Base is the base address of the timer module.
//!
//! \return Returns \c true if the base address is valid and \c false
//! otherwise.
//
//*****************************************************************************
static bool
TimerBaseValid(uint32_t ui32Base)
{
    return((ui32Base == GPT0_BASE) || (ui32Base == GPT1_BASE) ||
           (ui32Base == GPT2_BASE) || (ui32Base == GPT3_BASE));
}
#endif

//*****************************************************************************
//
//! \brief Enables the timer(s).
//!
//! This function enables operation of the timer module. The timer must be
//! configured before it is enabled.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to enable. Must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerEnable(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == TIMER_A) || (ui32Timer == TIMER_B) ||
           (ui32Timer == TIMER_BOTH));

    //
    // Enable the timer(s) module.
    //
    HWREG(ui32Base + GPT_O_CTL) |= ui32Timer & (GPT_CTL_TAEN | GPT_CTL_TBEN);
}

//*****************************************************************************
//
//! \brief Disables the timer(s).
//!
//! This function disables operation of the timer module.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to disable. Must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerDisable(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == TIMER_A) || (ui32Timer == TIMER_B) ||
           (ui32Timer == TIMER_BOTH));

    //
    // Disable the timer module.
    //
    HWREG(ui32Base + GPT_O_CTL) &= ~(ui32Timer &
                                     (GPT_CTL_TAEN | GPT_CTL_TBEN));
}

//*****************************************************************************
//
//! \brief Configures the timer(s).
//!
//! This function configures the operating mode of the timer(s). The timer
//! module is disabled before being configured and is left in the disabled
//! state.
//!
//! The timers are comprised of two 16-bit timers that can
//! operate independently or be concatenated to form a 32-bit timer.
//!
//! \note If the timers are used independently the length of timer can be
//! extended to 24 bit by use of an 8 bit prescale register set using
//! \ref TimerPrescaleSet().
//!
//! When configuring for full-width timer \c ui32Config is set
//! as one of the following values:
//! - \ref TIMER_CFG_ONE_SHOT    : Full-width one-shot timer.
//! - \ref TIMER_CFG_ONE_SHOT_UP : Full-width one-shot timer that counts up
//!   instead of down.
//! - \ref TIMER_CFG_PERIODIC    : Full-width periodic timer.
//! - \ref TIMER_CFG_PERIODIC_UP : Full-width periodic timer that counts up
//!   instead of down.
//! - \ref TIMER_CFG_RTC         : Full-width real time clock timer.
//!
//! When configuring for a pair of half-width timers, each timer is separately
//! configured. The timers are configured by setting \c ui32Config to
//! the bitwise OR of one of each of the following three:
//! - Use half-width timers:
//!   - \ref TIMER_CFG_SPLIT_PAIR
//! - Timer A:
//!   - \ref TIMER_CFG_A_ONE_SHOT     : Half-width one-shot timer
//!   - \ref TIMER_CFG_A_ONE_SHOT_UP  : Half-width one-shot timer that counts up
//!     instead of down.
//!   - \ref TIMER_CFG_A_PERIODIC     : Half-width periodic timer
//!   - \ref TIMER_CFG_A_PERIODIC_UP  : Half-width periodic timer that counts up
//!     instead of down.
//!   - \ref TIMER_CFG_A_CAP_COUNT    : Half-width edge count capture
//!   - \ref TIMER_CFG_A_CAP_COUNT_UP : Half-width edge count capture that counts
//!     up instead of down.
//!   - \ref TIMER_CFG_A_CAP_TIME     : Half-width edge time capture
//!   - \ref TIMER_CFG_A_CAP_TIME_UP  : Half-width edge time capture that counts up
//!     instead of down.
//!   - \ref TIMER_CFG_A_PWM          : Half-width PWM output
//! - Timer B:
//!   - Same as Timer A but using TIMER_CFG_B_* instead.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Config is the configuration for the timer.
//!
//! \return None
//
//*****************************************************************************
extern void TimerConfigure(uint32_t ui32Base, uint32_t ui32Config);

//*****************************************************************************
//
//! \brief Controls the output level.
//!
//! This function configures the PWM output level for the specified timer.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to adjust. Must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//! \param bInvert specifies the output level.
//! - \c true  : Timer's output is active low.
//! - \c false : Timer's output is active high.
//!
//! \return None
//
//*****************************************************************************
extern void TimerLevelControl(uint32_t ui32Base, uint32_t ui32Timer,
                              bool bInvert);

//*****************************************************************************
//
//! \brief Enables or disables the ADC trigger output.
//!
//! This function controls the ADC trigger output for the specified timer.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer to adjust; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//! \param bEnable specifies the desired ADC trigger state.
//! - \c true  : Enable timer's ADC output trigger.
//! - \c false : Disable timer's ADC output trigger.
//!
//! \return None
//
//*****************************************************************************
extern void TimerTriggerControl(uint32_t ui32Base, uint32_t ui32Timer,
                                bool bEnable);

//*****************************************************************************
//
//! \brief Controls the event type.
//!
//! This function configures the signal edge(s) that triggers the timer when
//! in capture mode.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to be adjusted; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//! \param ui32Event specifies the type of event; must be one of:
//! - \ref TIMER_EVENT_POS_EDGE
//! - \ref TIMER_EVENT_NEG_EDGE
//! - \ref TIMER_EVENT_BOTH_EDGES
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerEventControl(uint32_t ui32Base, uint32_t ui32Timer, uint32_t ui32Event)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == TIMER_A) || (ui32Timer == TIMER_B) ||
           (ui32Timer == TIMER_BOTH));

    //
    // Set the event type.
    //
    ui32Timer &= GPT_CTL_TAEVENT_M | GPT_CTL_TBEVENT_M;
    HWREG(ui32Base + GPT_O_CTL) = ((HWREG(ui32Base + GPT_O_CTL) & ~ui32Timer) |
                                   (ui32Event & ui32Timer));
}

//*****************************************************************************
//
//! \brief Controls the stall handling.
//!
//! This function controls the stall response for the specified timer. If the
//! \e bStall parameter is \b true, then the timer stops counting if the
//! processor enters debug mode; otherwise the timer keeps running while in
//! debug mode.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to be adjusted; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//! \param bStall specifies the response to a stall signal.
//! - \c true  : Timer stops counting if the processor enters debug mode.
//! - \c false : Timer keeps running if the processor enters debug mode.
//!
//! \return None
//
//*****************************************************************************
extern void TimerStallControl(uint32_t ui32Base, uint32_t ui32Timer,
                              bool bStall);

//*****************************************************************************
//
//! \brief Controls the wait on trigger handling.
//!
//! This function controls whether or not a timer waits for a trigger input to
//! start counting. When enabled, the previous timer in the trigger chain must
//! count to its timeout in order for this timer to start counting. Refer to
//! the part's data sheet for a description of the trigger chain.
//!
//! \note This function should not be used for Timer 0A or Wide Timer 0A.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to be adjusted; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//! \param bWait specifies if the timer should wait for a trigger input.
//! - \c true  : Wait for trigger.
//! - \c false : Do not wait for trigger.
//!
//! \return None
//
//*****************************************************************************
extern void TimerWaitOnTriggerControl(uint32_t ui32Base, uint32_t ui32Timer,
                                      bool bWait);

//*****************************************************************************
//
//! \brief Enable RTC counting.
//!
//! This function causes the timer to start counting when in RTC mode. If not
//! configured for RTC mode, this function does nothing.
//!
//! \param ui32Base is the base address of the timer module.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerRtcEnable(uint32_t ui32Base)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));

    //
    // Enable RTC counting.
    //
    HWREG(ui32Base + GPT_O_CTL) |= GPT_CTL_RTCEN;
}

//*****************************************************************************
//
//! \brief Disable RTC counting.
//!
//! This function causes the timer to stop counting when in RTC mode.
//!
//! \param ui32Base is the base address of the timer module.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerRtcDisable(uint32_t ui32Base)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));

    //
    // Disable RTC counting.
    //
    HWREG(ui32Base + GPT_O_CTL) &= ~(GPT_CTL_RTCEN);
}

//*****************************************************************************
//
//! \brief Set the timer prescale value.
//!
//! This function configures the value of the timer clock prescaler. The
//! prescaler is only operational when in half-width mode and is used to extend
//! the range of the half-width timer modes.
//!
//! When in one-shot or periodic down count modes, \b ui32Value defines the
//! prescaler for the timer counter. When acting as a true prescaler, the
//! prescaler counts down to 0 before the value in timer registers are incremented.
//!
//! In all other individual/split modes, \b ui32Value is a linear extension of
//! the upper range of the timer counter, holding bits 23:16 in the 16-bit modes
//! of the 16/32-bit timer.
//!
//! \note Because the prescaler counts down to 0 the timer division ratio equals
//! \b ui32Value + 1. E.g. a prescale value of 15 divides the timer rate by 16.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to adjust; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//! \param ui32Value is the timer prescale value which must be between 0 and 255
//! (both included).
//! - 0   : Timer division ratio = 1 (disable prescaling).
//! - 1   : Timer division ratio = 2.
//! - ...
//! - 255 : Timer division ratio = 256.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerPrescaleSet(uint32_t ui32Base, uint32_t ui32Timer, uint32_t ui32Value)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == TIMER_A) || (ui32Timer == TIMER_B) ||
           (ui32Timer == TIMER_BOTH));
    ASSERT(ui32Value < 256);

    //
    // Set the timer A prescaler if requested.
    //
    if(ui32Timer & TIMER_A)
    {
        HWREG(ui32Base + GPT_O_TAPR) = ui32Value;
    }

    //
    // Set the timer B prescaler if requested.
    //
    if(ui32Timer & TIMER_B)
    {
        HWREG(ui32Base + GPT_O_TBPR) = ui32Value;
    }
}

//*****************************************************************************
//
//! \brief Get the timer prescale value.
//!
//! This function gets the value of the timer clock prescaler. The
//! prescaler is only operational when in half-width mode and is used to extend
//! the range of the half-width timer modes.
//!
//! When in one-shot or periodic down count modes, \b ui32Value defines the
//! prescaler for the timer counter. When acting as a true prescaler, the
//! prescaler counts down to 0 before the value in timer registers are incremented.
//!
//! In all other individual/split modes, \b ui32Value is a linear extension of
//! the upper range of the timer counter, holding bits 23:16 in the 16-bit modes
//! of the 16/32-bit timer.
//!
//! \note Because the prescaler counts down to 0 the timer division ratio equals
//! \b ui32Value + 1. E.g. a prescale value of 15 divides the timer rate by 16.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//!
//! \return Returns the value of the timer prescaler.
//
//*****************************************************************************
__STATIC_INLINE uint32_t
TimerPrescaleGet(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == TIMER_A) || (ui32Timer == TIMER_B) ||
           (ui32Timer == TIMER_BOTH));

    //
    // Return the appropriate prescale value.
    //
    return((ui32Timer == TIMER_A) ? HWREG(ui32Base + GPT_O_TAPR) :
           HWREG(ui32Base + GPT_O_TBPR));
}

//*****************************************************************************
//
//! \brief Set the timer prescale match value.
//!
//! This function configures the value of the input clock prescaler match
//! value. When in a half-width mode that uses the counter match and the
//! prescaler, the prescale match effectively extends the range of the match.
//! The prescaler provides the least significant bits when counting down in
//! periodic and one-shot modes; in all other modes, the prescaler provides the
//! most significant bits.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to adjust; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//! \param ui32Value is the timer prescale match value which must be between 0
//! and 255 (both included).
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerPrescaleMatchSet(uint32_t ui32Base, uint32_t ui32Timer, uint32_t ui32Value)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == TIMER_A) || (ui32Timer == TIMER_B) ||
           (ui32Timer == TIMER_BOTH));
    ASSERT(ui32Value < 256);

    //
    // Set the timer A prescale match if requested.
    //
    if(ui32Timer & TIMER_A)
    {
        HWREG(ui32Base + GPT_O_TAPMR) = ui32Value;
    }

    //
    // Set the timer B prescale match if requested.
    //
    if(ui32Timer & TIMER_B)
    {
        HWREG(ui32Base + GPT_O_TBPMR) = ui32Value;
    }
}

//*****************************************************************************
//
//! \brief Get the timer prescale match value.
//!
//! This function gets the value of the input clock prescaler match value.
//! When in a half-width mode that uses the counter match and prescaler, the
//! prescale match effectively extends the range of the match. The prescaler
//! provides the least significant bits when counting down in periodic and
//! one-shot modes; in all other modes, the prescaler provides the most
//! significant bits.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//!
//! \return Returns the value of the timer prescale match.
//
//*****************************************************************************
__STATIC_INLINE uint32_t
TimerPrescaleMatchGet(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == TIMER_A) || (ui32Timer == TIMER_B));

    //
    // Return the appropriate prescale match value.
    //
    return((ui32Timer == TIMER_A) ? HWREG(ui32Base + GPT_O_TAPMR) :
           HWREG(ui32Base + GPT_O_TBPMR));
}

//*****************************************************************************
//
//! \brief Sets the timer load value.
//!
//! This function configures the timer load value; if the timer is running then
//! the value is immediately loaded into the timer.
//!
//! \note This function can be used for both full- and half-width modes of
//! 16/32-bit timers.
//!
//! \note Only \ref TIMER_A should be used when the timer is configured for
//! full-width operation.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to adjust; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//! \param ui32Value is the load value.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerLoadSet(uint32_t ui32Base, uint32_t ui32Timer, uint32_t ui32Value)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == TIMER_A) || (ui32Timer == TIMER_B) ||
           (ui32Timer == TIMER_BOTH));

    //
    // Set the timer A load value if requested.
    //
    if(ui32Timer & TIMER_A)
    {
        HWREG(ui32Base + GPT_O_TAILR) = ui32Value;
    }

    //
    // Set the timer B load value if requested.
    //
    if(ui32Timer & TIMER_B)
    {
        HWREG(ui32Base + GPT_O_TBILR) = ui32Value;
    }
}

//*****************************************************************************
//
//! \brief Gets the timer load value.
//!
//! This function gets the currently programmed interval load value for the
//! specified timer.
//!
//! \note This function can be used for both full- and half-width modes of
//! 16/32-bit timers.
//!
//! \note Only \ref TIMER_A should be used when the timer is configured for
//! full-width operation.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//!
//! \return Returns the load value for the timer
//
//*****************************************************************************
__STATIC_INLINE uint32_t
TimerLoadGet(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == TIMER_A) || (ui32Timer == TIMER_B));

    //
    // Return the appropriate load value.
    //
    return((ui32Timer == TIMER_A) ? HWREG(ui32Base + GPT_O_TAILR) :
           HWREG(ui32Base + GPT_O_TBILR));
}

//*****************************************************************************
//
//! \brief Gets the current timer value.
//!
//! This function reads the current value of the specified timer.
//!
//! \note This function can be used for both full- and half-width modes of
//! 16/32-bit timers.
//!
//! \note Only \ref TIMER_A should be used when the timer is configured for
//! full-width operation.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//!
//! \return Returns the current value of the timer.
//
//*****************************************************************************
__STATIC_INLINE uint32_t
TimerValueGet(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == TIMER_A) || (ui32Timer == TIMER_B));

    //
    // Return the appropriate timer value.
    //
    return((ui32Timer == TIMER_A) ? HWREG(ui32Base + GPT_O_TAR) :
           HWREG(ui32Base + GPT_O_TBR));
}

//*****************************************************************************
//
//! \brief Sets the timer match value.
//!
//! This function configures the match value for a timer. This value is used
//! in capture count mode to determine when to interrupt the processor and in
//! PWM mode to determine the duty cycle of the output signal. Match interrupts
//! can also be generated in periodic and one-shot modes when the value of the
//! counter matches this register.
//!
//! \note This function can be used for both full- and half-width modes of
//! 16/32-bit timers.
//!
//! \note Only \ref TIMER_A should be used when the timer is configured for
//! full-width operation.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to adjust; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//! \param ui32Value is the match value.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerMatchSet(uint32_t ui32Base, uint32_t ui32Timer, uint32_t ui32Value)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == TIMER_A) || (ui32Timer == TIMER_B) ||
           (ui32Timer == TIMER_BOTH));

    //
    // Set the timer A match value if requested.
    //
    if(ui32Timer & TIMER_A)
    {
        HWREG(ui32Base + GPT_O_TAMATCHR) = ui32Value;
    }

    //
    // Set the timer B match value if requested.
    //
    if(ui32Timer & TIMER_B)
    {
        HWREG(ui32Base + GPT_O_TBMATCHR) = ui32Value;
    }
}

//*****************************************************************************
//
//! \brief Gets the timer match value.
//!
//! This function gets the match value for the specified timer.
//!
//! \note This function can be used for both full- and half-width modes of
//! 16/32-bit timers.
//!
//! \note Only \ref TIMER_A should be used when the timer is configured for
//! full-width operation.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//!
//! \return Returns the match value for the timer
//
//*****************************************************************************
__STATIC_INLINE uint32_t
TimerMatchGet(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == TIMER_A) || (ui32Timer == TIMER_B));

